Revit 2026 API

# SchemaBuilder Constructor

---

Constructs a new SchemaBuilder where the resulting Schema will use the input GUID.

**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public SchemaBuilder(
	Guid guid
)
```
```vb
Public Sub New (
	guid As Guid
)
```
```cpp
public:
SchemaBuilder(
	Guid guid
)
```
```fsharp
new :
        guid : Guid -> SchemaBuilder
```

#### Parameters

guid Guid

| Exception | Condition |
| --- | --- |
| ArgumentException | The guid value is invalid. |

#### Reference

SchemaBuilder Class

Autodesk.Revit.DB.ExtensibleStorage Namespace